---
kind: enumMember
id: F:Autodesk.Revit.DB.CurveProjectionType.FromTopDown
enum: Autodesk.Revit.DB.CurveProjectionType
source: html/5669d7b4-2440-877f-5889-9390af7f8542.htm
---
# Autodesk.Revit.DB.CurveProjectionType.FromTopDown

Projects curve in a direction parallel to the height of the project or family (projects in an upwardly or downwardly direction).
 For example, would be used to project curves to a surface that represented a roof or site,
 where the goal was for the curves to look from above as they were sketched,
 even though they are being mapped to the surface.